# (Part 8)

### preliminary staging

In [114]:
import os
import pandas as pd
import numpy as np

In [115]:
os.chdir('C:\\Users\\Joshua\\Desktop\\PERSONAL\\Joshua Harvey\\education\\youtube\\Corey Schafer\\Python Tutorials\\data')

In [116]:
df = pd.read_csv('survey_results_public.csv', index_col = 'Respondent')

In [117]:
df['Age'].dtype

dtype('float64')

In [118]:
df.groupby(['Hobbyist'])['Age'].sum()

Hobbyist
No      494401.3
Yes    1908568.6
Name: Age, dtype: float64

### Cleaning Data

In [119]:
people = {
    "first": ["Joshua","Rebecca","Diane","John", "John", np.nan, None, None],
    "middle": ["Daniel", "Lee", "Elizabeth", "Kohler", "Fake", "Fake", "Miranda",None],
    "last": ["Harvey", "Winter", "McCabe", "Marsh", "NA", "Doe", "Rodriguez", None],
    "age": [31,27,60,58,10,10,25,None],
    "gender": ["male","female",np.nan,None,'NA',"male","female",None]
}
peeps = pd.DataFrame(people)

In [120]:
peeps

     first     middle       last   age  gender
0   Joshua     Daniel     Harvey  31.0    male
1  Rebecca        Lee     Winter  27.0  female
2    Diane  Elizabeth     McCabe  60.0     NaN
3     John     Kohler      Marsh  58.0    None
4     John       Fake         NA  10.0      NA
5      NaN       Fake        Doe  10.0    male
6     None    Miranda  Rodriguez  25.0  female
7     None       None       None   NaN    None

### dealing with n/a types

In [121]:
# -- drops 'any' rows with 
# -- also the same as peeps.dropna(axis='index', how='any') which are the default arguments
peeps.dropna()

     first  middle    last   age  gender
0   Joshua  Daniel  Harvey  31.0    male
1  Rebecca     Lee  Winter  27.0  female
4     John    Fake      NA  10.0      NA

In [91]:
# -- drops rows where the entire row is empty values
peeps.dropna(axis='index', how='all')

     first     middle       last   age  gender
0   Joshua     Daniel     Harvey  31.0    male
1  Rebecca        Lee     Winter  27.0  female
2    Diane  Elizabeth     McCabe  60.0     NaN
3     John     Kohler      Marsh  58.0    None
4     John       Fake         NA  10.0      NA
5      NaN       Fake        Doe  10.0    male
6     None    Miranda  Rodriguez  25.0  female

In [92]:
# -- drops any column with a single empty value
peeps.dropna(axis='columns', how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7]

In [56]:
# -- must have first and last name. should drop rows 7 

peeps.dropna(axis='index', how='all', subset=['first', 'last'])

     first     middle       last   age  gender
0   Joshua     Daniel     Harvey  31.0    male
1  Rebecca        Lee     Winter  27.0  female
2    Diane  Elizabeth     McCabe  60.0     NaN
3     John     Kohler      Marsh  58.0    None
4     John       Fake         NA  10.0      NA
5      NaN       Fake        Doe  10.0    male
6     None    Miranda  Rodriguez  25.0  female

In [93]:
peeps.replace('NA', None)

     first     middle       last   age  gender
0   Joshua     Daniel     Harvey  31.0    male
1  Rebecca        Lee     Winter  27.0  female
2    Diane  Elizabeth     McCabe  60.0     NaN
3     John     Kohler      Marsh  58.0    None
4     John       Fake      Marsh  10.0    None
5      NaN       Fake        Doe  10.0    male
6     None    Miranda  Rodriguez  25.0  female
7     None       None       None   NaN    None

In [94]:
peeps.dropna(axis='index', how='any', subset=['first','middle'])

     first     middle    last   age  gender
0   Joshua     Daniel  Harvey  31.0    male
1  Rebecca        Lee  Winter  27.0  female
2    Diane  Elizabeth  McCabe  60.0     NaN
3     John     Kohler   Marsh  58.0    None
4     John       Fake      NA  10.0      NA

In [95]:
peeps.isna()

   first  middle   last    age  gender
0  False   False  False  False   False
1  False   False  False  False   False
2  False   False  False  False    True
3  False   False  False  False    True
4  False   False  False  False   False
5   True   False  False  False   False
6   True   False  False  False   False
7   True    True   True   True    True

In [96]:
peeps = peeps.replace('- - -', None)

### Casting data types

In [97]:
peeps.dtypes

first      object
middle     object
last       object
age       float64
gender     object
dtype: object

In [103]:
peeps['age'].mean()

31.571428571428573

In [104]:
peeps

     first     middle       last   age  gender
0   Joshua     Daniel     Harvey  31.0    male
1  Rebecca        Lee     Winter  27.0  female
2    Diane  Elizabeth     McCabe  60.0     NaN
3     John     Kohler      Marsh  58.0    None
4     John       Fake         NA  10.0      NA
5      NaN       Fake        Doe  10.0    male
6     None    Miranda  Rodriguez  25.0  female
7     None       None       None   NaN    None

In [109]:
peeps = peeps.astype(object)

In [110]:
peeps.dtypes

first     object
middle    object
last      object
age       object
gender    object
dtype: object

In [111]:
peeps['age'] = peeps['age'].astype(float)

In [112]:
peeps.dtypes

first      object
middle     object
last       object
age       float64
gender     object
dtype: object

### working with the stackoverflow data

In [122]:
df.head(3)

,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,EduOther,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
Respondent,,,,,,,,,,,,,,,,,,,,,
1,I am a student who is learning to code,Yes,Never,The quality of OSS and closed source software ...,"Not employed, and not looking for work",United Kingdom,No,Primary/elementary school,NaN,"Taught yourself a new language, framework, or ...",...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,14.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
2,I am a student who is learning to code,No,Less than once per year,The quality of OSS and closed source software ...,"Not employed, but looking for work",Bosnia and Herzegovina,"Yes, full-time","Secondary school (e.g. American high school, G...",NaN,Taken an online course in programming or softw...,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,19.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
3,"I am not primarily a developer, but I write co...",Yes,Never,The quality of OSS and closed source software ...,Employed full-time,Thailand,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Web development or web design,"Taught yourself a new language, framework, or ...",...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,28.0,Man,No,Straight / Heterosexual,NaN,Yes,Appropriate in length,Neither easy nor difficult

In [124]:
# -- imports data and removes NA values during the import 

miss_vals = ['NA', 'Missing', 'N/A', 'none', 'None']
df = pd.read_csv('survey_results_public.csv', index_col = 'Respondent', na_values=miss_vals)

In [128]:
df['YearsCode'].head(10)

Respondent
1       4
2     NaN
3       3
4       3
5      16
6      13
7       6
8       8
9      12
10     12
Name: YearsCode, dtype: object

In [129]:
df['YearsCode'].astype(float)

ValueError: could not convert string to float: 'Less than 1 year'

In [136]:
df['YearsCode'].value_counts().head(50).sort_values(ascending=False)

5                     7047
10                    6777
6                     6179
4                     5729
8                     5361
7                     5320
3                     5179
2                     3974
15                    3942
20                    3636
12                    3530
9                     3360
11                    2265
14                    2126
13                    2036
18                    1900
1                     1814
25                    1657
16                    1593
30                    1532
Less than 1 year      1367
17                    1349
19                    1018
22                    1016
35                     873
23                     745
21                     715
24                     693
40                     497
28                     465
32                     420
26                     409
27                     408
33                     353
38                     340
34                     327
37                     321
36                     308
29                     234
31                     202
39                     170
More than 50 years     126
42                     115
45                     113
41                      92
43                      83
44                      52
50                      51
47                      36
48                      31
Name: YearsCode, dtype: int64

In [140]:
set(df['YearsCode'])

{'1',
 '10',
 '11',
 '12',
 '13',
 '14',
 '15',
 '16',
 '17',
 '18',
 '19',
 '2',
 '20',
 '21',
 '22',
 '23',
 '24',
 '25',
 '26',
 '27',
 '28',
 '29',
 '3',
 '30',
 '31',
 '32',
 '33',
 '34',
 '35',
 '36',
 '37',
 '38',
 '39',
 '4',
 '40',
 '41',
 '42',
 '43',
 '44',
 '45',
 '46',
 '47',
 '48',
 '49',
 '5',
 '50',
 '6',
 '7',
 '8',
 '9',
 'Less than 1 year',
 'More than 50 years',
 nan}

In [143]:
pd.set_option('display.max_rows',100)
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [147]:
df['YearsCode'].replace('Less than 1 year',0, inplace=True)
df['YearsCode'].replace('More than 50 years',51, inplace=True)

In [148]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 0, '30', '9', '26', '40', '19', '15', '20', '28',
       '25', '1', '22', '11', '33', '50', '41', '18', '34', '24', '23',
       '42', '27', '21', '36', '32', '39', '38', '31', '37', 51, '29',
       '44', '45', '48', '46', '43', '47', '49'], dtype=object)

In [150]:
# -- still an object although can be converted with astype method
# -- this approach converts on the fly and doesn't actually change the type in the dataframe
df['YearsCode'].astype(float).mean()

11.662114216834588